EDT/УТ/src/BusinessProcesses/новаЗавершениеМестнойДоставки/новаЗавершениеМестнойДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>новаЗавершениеМестнойДоставки</name>
  <task>Task.новаЗадачаМестнойДоставки</task>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаВыполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаВыполненаЧастично</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

EDT/УТ/src/BusinessProcesses/новаЗавершениеМестнойДоставки/ObjectModule.bsl
Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	обВедущаяЗадача = ВедущаяЗадача.ПолучитьОбъект();
	Попытка
	обВедущаяЗадача.ДоставкаЗавершена = ДоставкаЗавершена;
исключение
	Возврат;
КонецПопытки;
	обВедущаяЗадача.ДоставкаВыполнена = ДоставкаВыполнена;
	обВедущаяЗадача.ДоставкаВыполненаЧастично = ДоставкаВыполненаЧастично;
	обВедущаяЗадача.РезультатДоставки = РезультатДоставки;
	обВедущаяЗадача.Записать();
КонецПроцедуры

Процедура ВводОтчетаОДоставкеПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ДоставкаЗавершена = Задача.ДоставкаЗавершена;
	ДоставкаВыполнена = Задача.ДоставкаВыполнена;
	ДоставкаВыполненаЧастично = Задача.ДоставкаВыполненаЧастично;
	РезультатДоставки = Задача.РезультатДоставки;
КонецПроцедуры
